app/views/people/show.html.erb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."person_id" = ?  [["person_id", 1]]
---
  <tbody>
    <% @person.addresses.each do |address| %>

SELECT "cars".* FROM "cars" INNER JOIN "cars_people" ON "cars"."id" = "cars_people"."car_id" WHERE "cars_people"."person_id" = ?  [["person_id", 1]]
---
  </thead>
  <% @person.cars.each do |c| %>

SELECT "albums".* FROM "albums" WHERE "albums"."person_id" = ?  [["person_id", 1]]
---
  <tbody>
    <% @person.albums.each do |a| %>