app/controllers/addresses_controller.rb

	def create
		@person = Person.find(params[:person_id])

		@address = @person.addresses.new(permit_params)
		if  @address.save
---
INSERT INTO "addresses" ("line1", "line2", "state", "person_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["line1", "asdasd"], ["line2", "asdasd"], ["state", "asdasd"], ["person_id", 9], ["created_at", "2015-05-18 23:36:01.775278"], ["updated_at", "2015-05-18 23:36:01.775278"]]

	def edit
		@address = Address.find(params[:id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT 1  [["id", 2]]

	def update
		@address = Address.find(params[:id])

		if @address.update(permit_params)
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "addresses" SET "state" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["state", "Mirandadfsdf"], ["updated_at", "2015-05-19 00:17:31.523663"], ["id", 2]]

 	def destroy
    address = Address.find(params[:id])
    if address.destroy
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT 1  [["id", 13]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 13]]