app/controllers/people_controller.rb

  def create_profile
    #Metodo para construir cuando es de 1..1
    @person.build_profile(permit_params_profile)
    if @person.profile.save
---
INSERT INTO "profiles" ("twitter_url", "github_url", "person_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["twitter_url", "dfgdgfdg"], ["github_url", "dfgdfgfdg"], ["person_id", 1], ["created_at", "2015-05-21 00:10:24.374211"], ["updated_at", "2015-05-21 00:10:24.374211"]]